---
kind: property
id: P:Autodesk.Revit.DB.AreaScheme.IsGrossBuildingArea
source: html/71a18217-7ec4-018f-4cd1-ced41b8d9e1b.htm
---
# Autodesk.Revit.DB.AreaScheme.IsGrossBuildingArea Property

Indicates if the area scheme is a Gross Building Area scheme.

## Syntax (C#)
```csharp
public bool IsGrossBuildingArea { get; }
```